[
  {
    "id": 1,
    "companyName": "Grameenphone",
    "jobDescription": "Internship in telecom operations, marketing, and data analytics.",
    "ceoName": "Yasir Azman",
    "publishedDate": "2024-05-21",
    "image": "/images/grameenphone.jpg",
    "website": "https://www.grameenphone.com",
    "article": "Grameenphone, the largest telecommunications service provider in Bangladesh, offers a dynamic internship program aimed at grooming future leaders in the telecom sector. With its vast network infrastructure, data services, and customer-centric approach, Grameenphone is an ideal platform for young professionals looking to understand the depth of telecommunications operations.\n\nInterns at Grameenphone are placed across various departments such as network engineering, product development, digital marketing, customer experience, and analytics. The internship begins with a thorough onboarding session where interns learn about the company’s mission, sustainability practices, and market influence.\n\nOne of the most valuable aspects of this internship is its hands-on learning environment. Interns are assigned live projects that directly contribute to organizational goals. For example, marketing interns may be asked to strategize a campaign for youth engagement or analyze digital behavior patterns, while technical interns may assist with 4G optimization, infrastructure upgrades, or data modeling.\n\nMentorship is a key component of the internship. Every intern is paired with a supervisor or team lead who provides regular feedback, guidance, and opportunities for one-on-one coaching. Weekly check-ins and knowledge-sharing sessions further enrich the experience.\n\nGrameenphone also integrates interns into its social impact initiatives. Interns may contribute to projects that focus on digital literacy, women empowerment, and climate sustainability, aligning their learning with broader community engagement.\n\nApplicants are expected to be in their final year of undergraduate studies or recent graduates. Preferred fields include business, marketing, engineering, and computer science. A high level of communication skill, adaptability, and curiosity are valued during selection.\n\nCompleting an internship at Grameenphone not only enhances technical and strategic skills but also offers deep insights into one of Bangladesh’s most innovative companies. Many former interns continue as full-time employees, contributing to Grameenphone’s growth as a technology and lifestyle brand."
  },
  {
    "id": 2,
    "companyName": "Robi Axiata",
    "jobDescription": "Internship in digital transformation, software development, and telecom engineering.",
    "ceoName": "Rajeev Sethi",
    "publishedDate": "2024-05-23",
    "image": "/images/robi.jpg",
    "website": "https://www.robi.com.bd",
    "article": "Robi Axiata Limited is a leading telecommunications company known for digital innovation and cutting-edge customer experience. As a subsidiary of Malaysia’s Axiata Group, Robi focuses heavily on digital transformation and business intelligence.\n\nIts internship program, often titled 'Robi Young Talent', provides university students with a platform to work on next-generation technology, agile product development, and customer analytics. Interns work in areas such as DevOps, UX/UI design, AI research, mobile app development, and social media marketing.\n\nThe program kicks off with a digital orientation that gives interns a peek into the Robi Way — a framework built on trust, innovation, and purpose-driven leadership. Interns are then embedded into teams, where they are treated as valuable contributors rather than observers.\n\nEach intern is given a meaningful challenge. For instance, a software intern might be tasked with debugging a customer self-care portal, while a business intern may analyze customer churn patterns using BI tools. Some interns even get to experiment with IoT and smart device APIs.\n\nInterns are also encouraged to present weekly progress reports and pitch improvement ideas during demo days. These sessions are attended by senior management, providing great exposure.\n\nThe selection process is rigorous — applicants go through aptitude tests, interviews, and case studies. Candidates with a digital mindset, data fluency, and passion for technology are given preference.\n\nA Robi internship helps young graduates build skills in agile environments, enhance their digital toolkits, and understand real-world telecom issues. Many alumni of the program go on to work in Robi’s IT, marketing, and analytics divisions."
  },
  {
    "id": 3,
    "companyName": "bKash",
    "jobDescription": "Internship in fintech operations, mobile payment systems, and data security.",
    "ceoName": "Kamal Quadir",
    "publishedDate": "2024-05-25",
    "image": "/images/bkash.jpg",
    "website": "https://www.bkash.com",
    "article": "bKash Limited is a pioneering mobile financial service provider in Bangladesh that has revolutionized digital transactions and financial inclusion. The bKash Internship Program allows university students to engage with real-world fintech operations.\n\nInterns join departments like Operations, Product Innovation, Compliance, or IT Security. The experience offers a deep dive into mobile money transfer systems, user behavior, and fraud prevention techniques.\n\nAt bKash, interns contribute to internal audits, app development, customer service automation, and risk analysis. Their input often influences app features, wallet interface changes, and transaction safety mechanisms.\n\nA standout feature of the internship is its structured mentorship. Each intern is assigned a mentor who supports their career growth, provides feedback, and offers weekly learning sessions on fintech regulations, UX, and agile development.\n\nInterns also get exposure to real-time financial dashboards and use tools like SQL, Power BI, and Python to generate insights. Cross-functional collaboration ensures they work alongside legal, data science, and marketing teams.\n\nIdeal for finance, economics, software, and MIS students, bKash’s internship fosters responsible innovation and a problem-solving mindset. The application process includes an essay, case study, and interview.\n\nAn internship at bKash opens doors to fintech careers, offering a balance of innovation, ethics, and high-impact work. Alumni often join leading financial institutions or pursue global fintech careers."
  },
  {
    "id": 4,
    "companyName": "Pathao",
    "jobDescription": "Internship in product management, logistics, and app development.",
    "ceoName": "Fahim Ahmed",
    "publishedDate": "2024-05-27",
    "image": "/images/pathao.jpg",
    "website": "https://www.pathao.com",
    "article": "Pathao is one of the fastest-growing tech startups in Bangladesh, offering services in ride-sharing, food delivery, and logistics. The Pathao Internship Program is known for giving interns real ownership of product development, user experience, and logistics systems.\n\nInterns work in teams focused on fleet coordination, backend development, data operations, or partner management. A major focus is user acquisition, app feature testing, and route optimization.\n\nPathao operates in a highly competitive digital space, so interns quickly learn how to solve problems under pressure. They participate in daily standups, sprint planning, and retrospectives.\n\nInterns may build dashboards to track delivery performance, write SQL queries to monitor user behavior, or coordinate courier feedback for app improvements. Interns in the marketing team manage promotions or write UX content.\n\nTech interns are encouraged to build small tools and get them deployed. Interns attend weekly review meetings and often present findings to the leadership team.\n\nThis internship suits CS, logistics, or business students who thrive in fast-paced settings. Initiative, creativity, and collaboration are highly valued.\n\nGraduates of the Pathao internship go on to tech roles or start their own ventures."
  },
  {
    "id": 5,
    "companyName": "Shohoz",
    "jobDescription": "Internship in ticketing platform operations, digital marketing, and UI/UX design.",
    "ceoName": "Maliha M Quadir",
    "publishedDate": "2024-05-28",
    "image": "/images/shohoz.jpg",
    "website": "https://www.shohoz.com",
    "article": "Shohoz started as an online ticketing platform and has evolved into a super app offering transport, healthcare, and food delivery. Its internship program is designed for students passionate about digital products and customer-centric design.\n\nInterns work in operations, UI/UX, digital strategy, or customer experience. Interns may help optimize app flows, handle user research, or design marketing campaigns.\n\nA key part of the internship is analytics. Interns use dashboards to monitor app crashes, retention rates, and transaction flow. Product interns participate in A/B testing and feature roadmap discussions.\n\nWeekly brown-bag sessions expose interns to the entrepreneurial journey, leadership struggles, and Shohoz’s growth strategy. Interns collaborate with developers and business managers.\n\nStudents from business, design, or computer engineering backgrounds are ideal candidates. Shohoz values analytical thinking, digital literacy, and customer empathy.\n\nInterning at Shohoz offers a close look at super app development, user behavior, and agile scaling — valuable for careers in product or startup ecosystems."
  },
  {
    "id": 6,
    "companyName": "bloom",
    "jobDescription": "Internship in content marketing, community building, and brand management.",
    "ceoName": "Sarah Ahmed",
    "publishedDate": "2024-06-01",
    "image": "/images/bloom.jpg",
    "website": "https://www.bloom.com.bd",
    "article": "Bloom is a leading lifestyle and wellness brand in Bangladesh that focuses on building community through meaningful content and innovative brand experiences. Their internship program offers students exposure to content marketing strategies, social media management, and brand positioning techniques. Interns work closely with the marketing and communications teams to plan campaigns, produce engaging material, and analyze audience behavior.\n\nBloom’s internship is ideal for marketing, communication, and media students who want hands-on experience in brand storytelling. The program includes training sessions on digital marketing tools, SEO, and customer engagement analytics. Interns gain valuable insights into managing brand consistency across multiple platforms and developing influencer partnerships.\n\nBy the end of the internship, students will have contributed to Bloom’s social campaigns, assisted in event planning, and sharpened their project management skills. The company encourages creative thinking, collaboration, and proactive problem-solving, providing a rich learning environment for young marketers."
  },
  {
    "id": 7,
    "companyName": "DataEdge",
    "jobDescription": "Internship in data science, machine learning, and business analytics.",
    "ceoName": "Rafiq Chowdhury",
    "publishedDate": "2024-06-05",
    "image": "/images/dataedge.jpg",
    "website": "https://www.dataedge.com.bd",
    "article": "DataEdge is a pioneering data analytics firm specializing in machine learning and AI-driven solutions for businesses. Their internship program immerses students in real-world data challenges, including predictive modeling, data visualization, and algorithm development.\n\nInterns work alongside data scientists and engineers to preprocess datasets, build models using Python and R, and present insights to client teams. They gain experience with cloud computing platforms, data wrangling, and feature engineering.\n\nThe internship emphasizes both technical proficiency and business communication skills, as interns regularly explain complex results to non-technical stakeholders. Workshops on ethical AI and data privacy are also part of the curriculum.\n\nIdeal candidates are students of computer science, statistics, or mathematics with strong coding skills. The program prepares interns for careers in data science, AI research, and advanced analytics."
  },
  {
    "id": 8,
    "companyName": "Kazi IT",
    "jobDescription": "Internship in software development, QA testing, and IT project management.",
    "ceoName": "Kazi Md. Salim",
    "publishedDate": "2024-06-10",
    "image": "/images/kazi-it.jpg",
    "website": "https://www.kaziit.com",
    "article": "Kazi IT is a respected IT solutions provider in Bangladesh, delivering software development, QA, and IT consulting services. Their internship program offers hands-on learning in coding, software testing, and agile project workflows.\n\nInterns join cross-functional teams working on web and mobile applications for diverse industries. They learn best practices in version control, unit testing, and bug tracking. Additionally, interns are introduced to project management methodologies like Scrum and Kanban.\n\nThe company values a collaborative environment where interns can ask questions, share ideas, and participate in daily standups and sprint reviews. Real projects provide meaningful challenges and measurable outcomes.\n\nStudents with a background in computer science, software engineering, or information systems will find this internship valuable. It strengthens programming skills, teamwork, and understanding of the software development life cycle."
  },
  {
    "id": 9,
    "companyName": "Sheba.xyz",
    "jobDescription": "Internship in customer service, operations, and digital platform management.",
    "ceoName": "Tamara Zaman",
    "publishedDate": "2024-06-12",
    "image": "/images/sheba.jpg",
    "website": "https://www.sheba.xyz",
    "article": "Sheba.xyz is Bangladesh’s leading digital service marketplace connecting customers with local professionals. The internship program focuses on customer service excellence, operational efficiency, and digital product support.\n\nInterns assist in managing customer queries, onboarding service providers, and improving platform usability. They gain insights into service quality assurance, complaint resolution, and CRM software.\n\nWeekly training sessions cover data-driven decision making, customer psychology, and online marketing basics. Interns also analyze service trends and recommend improvements to boost satisfaction.\n\nIdeal interns are detail-oriented, communicative, and adaptable, with backgrounds in business, marketing, or IT. Sheba.xyz offers a unique chance to understand marketplace dynamics and user experience management."
  },
  {
    "id": 10,
    "companyName": "AjkerDeal",
    "jobDescription": "Internship in e-commerce operations, product sourcing, and digital advertising.",
    "ceoName": "Rifat Chowdhury",
    "publishedDate": "2024-06-15",
    "image": "/images/ajkerdeal.jpg",
    "website": "https://www.ajkerdeal.com",
    "article": "AjkerDeal is one of Bangladesh’s prominent e-commerce platforms, providing a wide range of products to consumers nationwide. Their internship program exposes students to the fast-paced world of online retail, covering supply chain management, product cataloging, and advertising.\n\nInterns work with the procurement team to understand vendor relations and product quality assurance. They support marketing efforts by designing digital ad campaigns, analyzing traffic, and optimizing conversion rates.\n\nThe program includes sessions on e-commerce logistics, payment gateways, and customer feedback loops. Interns develop skills in market research, competitor analysis, and digital analytics tools.\n\nStudents studying business, marketing, or IT are best suited for this internship. The experience builds competencies necessary for thriving in Bangladesh’s growing e-commerce sector."
  },
   {
    "id": 11,
    "companyName": "Banglalink",
    "jobDescription": "Internship in network engineering, marketing, and customer experience.",
    "ceoName": "Ihab Ghattas",
    "publishedDate": "2024-06-18",
    "image": "/images/banglalink.jpg",
    "website": "https://www.banglalink.net",
    "article": "Banglalink is one of the leading telecommunications companies in Bangladesh, known for its extensive network coverage and customer-centric services. The internship program at Banglalink provides students with opportunities to work in network engineering, digital marketing, and customer service operations.\n\nInterns get hands-on experience in monitoring and optimizing mobile network performance. They may assist in field surveys, data collection, and troubleshooting technical issues under the guidance of experienced engineers. Marketing interns work on campaigns designed to increase brand loyalty and expand market share through social media and on-ground activities.\n\nThe internship also emphasizes customer experience, where interns analyze feedback, suggest improvements, and develop customer engagement strategies. Training sessions on telecom regulations, technology updates, and market trends enrich the learning process.\n\nCandidates from engineering, business, and communications backgrounds are encouraged to apply. This internship equips students with both technical expertise and business insights required for a successful career in telecom."
  },
  {
    "id": 12,
    "companyName": "City Bank",
    "jobDescription": "Internship in banking operations, finance, and risk management.",
    "ceoName": "Md. Mosaddake-Uz-Zaman",
    "publishedDate": "2024-06-20",
    "image": "/images/citybank.jpg",
    "website": "https://www.thecitybank.com",
    "article": "City Bank is one of Bangladesh’s oldest and most reputable private banks. Its internship program offers students a comprehensive understanding of banking operations, finance management, and risk assessment.\n\nInterns are exposed to various departments including retail banking, credit analysis, compliance, and treasury. They assist in preparing financial reports, evaluating loan applications, and auditing internal processes. Through rotations, interns gain a holistic view of bank functioning.\n\nThe program includes workshops on financial regulations, anti-money laundering (AML) policies, and customer relationship management. Interns also learn to use banking software and financial modeling tools.\n\nIdeal candidates are finance, accounting, or economics students with analytical skills and attention to detail. City Bank’s internship provides a strong foundation for careers in banking and financial services."
  },
  {
    "id": 13,
    "companyName": "dbBL",
    "jobDescription": "Internship in digital banking, technology solutions, and customer service.",
    "ceoName": "Syed Mahbubur Rahman",
    "publishedDate": "2024-06-22",
    "image": "/images/dbbl.jpg",
    "website": "https://www.dbbl.com",
    "article": "Dutch-Bangla Bank Limited (dbBL) is a pioneer in digital banking in Bangladesh, famous for its ATM network and online banking solutions. The internship program focuses on technology innovation, customer service, and digital product management.\n\nInterns work with IT and customer support teams to improve online transaction platforms, mobile apps, and help desks. Projects often involve troubleshooting technical issues, conducting user surveys, and assisting in the rollout of new features.\n\nThe internship stresses learning through practice, with exposure to software development lifecycles, cybersecurity principles, and digital payment ecosystems. Interns present findings and recommendations to senior managers, gaining valuable communication experience.\n\nStudents from IT, computer science, and business backgrounds are encouraged. This internship is a stepping stone for careers in fintech and digital banking."
  },
  {
    "id": 14,
    "companyName": "Walton Group",
    "jobDescription": "Internship in manufacturing, supply chain, and product design.",
    "ceoName": "Anis A. Khan",
    "publishedDate": "2024-06-24",
    "image": "/images/walton.jpg",
    "website": "https://www.waltonbd.com",
    "article": "Walton Group is one of Bangladesh’s largest conglomerates, with a strong presence in electronics, appliances, and automotive sectors. Their internship program offers practical exposure to manufacturing processes, supply chain logistics, and product design.\n\nInterns rotate through departments such as production planning, quality assurance, procurement, and design engineering. They participate in factory tours, process documentation, and supplier negotiations.\n\nWalton emphasizes lean manufacturing principles and sustainability. Interns learn about inventory management software, production scheduling, and product lifecycle management. The program includes workshops on market trends and innovation management.\n\nIdeal interns are engineering, supply chain management, or business students. This internship builds skills critical for roles in manufacturing operations and industrial management."
  },
  {
    "id": 15,
    "companyName": "Karnaphuli Group",
    "jobDescription": "Internship in business development, finance, and strategic planning.",
    "ceoName": "Shafiqul Alam",
    "publishedDate": "2024-06-26",
    "image": "/images/karnaphuli.jpg",
    "website": "https://www.karnaphuligroup.com",
    "article": "Karnaphuli Group is a diversified business conglomerate with interests spanning textiles, garments, shipping, and real estate. Their internship program offers comprehensive exposure to business development, financial planning, and corporate strategy.\n\nInterns work alongside senior managers to analyze market opportunities, prepare financial forecasts, and assist in project evaluation. They participate in meetings, draft reports, and contribute to strategic decision-making.\n\nThe program integrates classroom sessions on corporate governance, risk management, and negotiation skills. Interns also gain insights into international trade and regulatory environments.\n\nStudents from business administration, finance, and economics backgrounds benefit the most. The Karnaphuli internship equips students for leadership roles in diverse industries."
  },
    {
    "id": 16,
    "companyName": "Grameenphone",
    "jobDescription": "Internship in telecommunications technology, customer experience, and digital marketing.",
    "ceoName": "Ihsan Khattak",
    "publishedDate": "2024-06-28",
    "image": "/images/grameenphone.jpg",
    "website": "https://www.grameenphone.com",
    "article": "Grameenphone is the largest telecommunications service provider in Bangladesh, renowned for its extensive network coverage and innovative digital solutions. Their internship program offers students the opportunity to work in telecommunications technology, customer experience management, and digital marketing.\n\nInterns are actively engaged in projects involving network optimization, customer service analysis, and online campaign execution. They participate in cross-functional teams that focus on enhancing service quality and expanding digital presence.\n\nTraining sessions cover the latest in 4G/5G technologies, data analytics, and customer relationship management tools. Interns also gain experience in market research and brand positioning.\n\nThis internship is ideal for students from engineering, business, and communications disciplines looking to gain practical insights into the telecom sector’s dynamic environment."
  },
  {
    "id": 17,
    "companyName": "Robi Axiata",
    "jobDescription": "Internship in mobile network operations, sales strategy, and digital innovation.",
    "ceoName": "Khaled Mahmud Chowdhury",
    "publishedDate": "2024-06-30",
    "image": "/images/robi.jpg",
    "website": "https://www.robi.com.bd",
    "article": "Robi Axiata is a leading mobile network operator in Bangladesh, known for its customer-focused services and technology-driven innovations. The internship program provides students with hands-on experience in network operations, sales strategy, and digital product development.\n\nInterns assist in monitoring network performance, analyzing sales data, and developing digital solutions to improve customer engagement. They also support marketing initiatives and product launches.\n\nThe program includes workshops on telecom regulations, digital marketing trends, and customer analytics tools. Interns gain exposure to emerging technologies like IoT and mobile payments.\n\nStudents from engineering, business, marketing, and IT backgrounds are encouraged to apply. The internship prepares them for diverse roles in the telecom and digital industries."
  },
  {
    "id": 18,
    "companyName": "Unilever Bangladesh",
    "jobDescription": "Internship in marketing, supply chain, and product innovation.",
    "ceoName": "Louise Moran",
    "publishedDate": "2024-07-02",
    "image": "/images/unilever.jpg",
    "website": "https://www.unilever.com.bd",
    "article": "Unilever Bangladesh is part of the global Unilever group, offering a wide range of consumer goods. Their internship program focuses on marketing strategies, supply chain management, and product innovation.\n\nInterns engage in brand building activities, market analysis, and demand forecasting. They work closely with supply chain teams to understand logistics, procurement, and inventory management.\n\nTraining on sustainability, consumer behavior, and digital marketing tools is provided. Interns contribute to product development projects by conducting competitor analysis and customer surveys.\n\nThis internship is well-suited for students in marketing, business administration, and supply chain disciplines who want to develop practical skills in a multinational corporate environment."
  },
  {
    "id": 19,
    "companyName": "BRAC Bank",
    "jobDescription": "Internship in retail banking, credit analysis, and financial technology.",
    "ceoName": "Syed Mahbubur Rahman",
    "publishedDate": "2024-07-05",
    "image": "/images/bracbank.jpg",
    "website": "https://www.bracbank.com",
    "article": "BRAC Bank is a prominent private commercial bank in Bangladesh focusing on retail banking and SME financing. Their internship program offers practical experience in credit analysis, financial technology, and customer service.\n\nInterns assist credit officers in evaluating loan proposals and risk assessments. They support fintech teams working on digital payment platforms and mobile banking apps.\n\nWorkshops on banking regulations, financial modeling, and customer relationship management are integral parts of the program. Interns are encouraged to participate in cross-departmental projects for holistic learning.\n\nStudents with finance, accounting, IT, or business backgrounds will find this internship valuable for their career development in banking and financial services."
  },
  {
    "id": 20,
    "companyName": "Square Pharmaceuticals",
    "jobDescription": "Internship in pharmaceutical marketing, quality control, and regulatory affairs.",
    "ceoName": "Samir Kumar Saha",
    "publishedDate": "2024-07-08",
    "image": "/images/squarepharma.jpg",
    "website": "https://www.squarepharma.com.bd",
    "article": "Square Pharmaceuticals is the largest pharmaceutical company in Bangladesh, known for its commitment to quality and innovation. Their internship program provides insights into pharmaceutical marketing, quality assurance, and regulatory compliance.\n\nInterns work alongside marketing teams to plan product launches, conduct market research, and develop promotional material. They also assist in quality control labs to understand testing procedures and compliance with national and international standards.\n\nRegulatory affairs exposure includes learning about drug registration processes and safety protocols. The program balances scientific rigor with commercial strategy.\n\nIdeal interns are students of pharmacy, biotechnology, marketing, or business administration seeking industry-relevant experience in the pharmaceutical sector."
  }
]
